witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_TRX_ATU_I(int8_t direction)
{
	#ifdef HAS_ATU
	if(TRX.ATU_I > 0 || direction > 0)
		TRX.ATU_I += direction;
	if (TRX.ATU_I > MAX_ATU_POS)
		TRX.ATU_I = MAX_ATU_POS;
	#endif
}

static void SYSMENU_HANDL_TRX_ATU_C(int8_t direction)
{
	#ifdef HAS_ATU
	if(TRX.ATU_C > 0 || direction > 0)
		TRX.ATU_C += direction;
	if (TRX.ATU_C > MAX_ATU_POS)
		TRX.ATU_C = MAX_ATU_POS;
	#endif
}

static void SYSMENU_HANDL_TRX_ATU_T(int8_t direction)
{
	#ifdef HAS_ATU
	if (direction > 0)
		TRX.ATU_T = true;
	if (direction < 0)
		TRX.ATU_T = false;
	#endif
}

//AUDIO MENU

static void SYSMENU_HANDL_AUDIOMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_audio_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_audio_handlers) / sizeof(sysmenu_audio_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

void SYSMENU_AUDIO_BW_SSB_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 7;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_CW_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 10;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_AM_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 11;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_BW_FM_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 13;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_HPF_SSB_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 6;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_HPF_CW_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 9;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_SQUELCH_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 15;
	LCD_redraw(false);
}

void SYSMENU_AUDIO_AGC_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	systemMenuIndex = 24;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_AUDIO_IFGain(int8_t direction)
{
	TRX.IF_Gain += direction;
	if (TRX.IF_Gain < 1)
		TRX.IF_Gain = 1;
	if (TRX.IF_Gain > 80)
		TRX.IF_Gain = 80;
}

static void SYSMENU_HANDL_AUDIO_AGC_GAIN_TARGET(int8_t direction)
{
	TRX.AGC_GAIN_TARGET += direction;
	if (TRX.AGC_GAIN_TARGET < -80)
		TRX.AGC_GAIN_TARGET = -80;
	if (TRX.AGC_GAIN_TARGET > -10)
		TRX.AGC_GAIN_TARGET = -10;
}

static void SYSMENU_HANDL_AUDIO_MIC_Gain(int8_t direction)
{
	TRX.MIC_GAIN += direction;
	if (TRX.MIC_GAIN < 1)
		TRX.MIC_GAIN = 1;
	if (TRX.MIC_GAIN > 20)
		TRX.MIC_GAIN = 20;
}

static void SYSMENU_HANDL_AUDIO_DNR_THRES(int8_t direction)
{
	TRX.DNR_SNR_THRESHOLD += direction;
	if (TRX.DNR_SNR_THRESHOLD < 1)
		TRX.DNR_SNR_THRESHOLD = 1;
	if (TRX.DNR_SNR_THRESHOLD > 100)
		TRX.DNR_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_AVERAGE(int8_t direction)
{
	TRX.DNR_AVERAGE += direction;
	if (TRX.DNR_AVERAGE < 1)
		TRX.DNR_AVERAGE = 1;
	if (TRX.DNR_AVERAGE > 100)
		TRX.DNR_AVERAGE = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_MINMAL(int8_t direction)
{
	TRX.DNR_MINIMAL += direction;
	if (TRX.DNR_MINIMAL < 1)
		TRX.DNR_MINIMAL = 1;
	if (TRX.DNR_MINIMAL > 100)
		TRX.DNR_MINIMAL = 100;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW(int8_t direction)
{
	TRX.MIC_EQ_LOW += direction;
	if (TRX.MIC_EQ_LOW < -10)
		TRX.MIC_EQ_LOW = -10;
	if (TRX.MIC_EQ_LOW > 10)
		TRX.MIC_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID(int8_t direction)
{
	TRX.MIC_EQ_MID += direction;
	if (TRX.MIC_EQ_MID < -10)
		TRX.MIC_EQ_MID = -10;
	if (TRX.MIC_EQ_MID > 10)
		TRX.MIC_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG(int8_t direction)
{
	TRX.MIC_EQ_HIG += direction;
	if (TRX.MIC_EQ_HIG < -10)
		TRX.MIC_EQ_HIG = -10;
	if (TRX.MIC_EQ_HIG > 10)
		TRX.MIC_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_REVERBER(int8_t direction)
{
	if (direction > 0 || TRX.MIC_REVERBER > 0)
		TRX.MIC_REVERBER += direction;
	if (TRX.MIC_REVERBER > (AUDIO_MAX_REVERBER_TAPS - 1))
		TRX.MIC_REVERBER = (AUDIO_MAX_REVERBER_TAPS - 1);
	NeedReinitReverber = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_LOW(int8_t direction)
{
	TRX.RX_EQ_LOW += direction;
	if (TRX.RX_EQ_LOW < -10)
		TRX.RX_EQ_LOW = -10;
	if (TRX.RX_EQ_LOW > 10)
		TRX.RX_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_MID(int8_t direction)
{
	TRX.RX_EQ_MID += direction;
	if (TRX.RX_EQ_MID < -10)
		TRX.RX_EQ_MID = -10;
	if (TRX.RX_EQ_MID > 10)
		TRX.RX_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_HIG(int8_t direction)
{
	TRX.RX_EQ_HIG += direction;
	if (TRX.RX_EQ_HIG < -10)
		TRX.RX_EQ_HIG = -10;
	if (TRX.RX_EQ_HIG > 10)
		TRX.RX_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_SSB_Speed(int8_t direction)
{
	TRX.RX_AGC_SSB_speed += direction;
	if (TRX.RX_AGC_SSB_speed < 1)
		TRX.RX_AGC_SSB_speed = 1;
	if (TRX.RX_AGC_SSB_speed > 20)
		TRX.RX_AGC_SSB_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_CW_Speed(int8_t direction)
{
	TRX.RX_AGC_CW_speed += direction;
	if (TRX.RX_AGC_CW_speed < 1)
		TRX.RX_AGC_CW_speed = 1;
	if (TRX.RX_AGC_CW_speed > 20)
		TRX.RX_AGC_CW_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed(int8_t direction)
{
	TRX.TX_Compressor_speed += direction;
	if (TRX.TX_Compressor_speed < 1)
		TRX.TX_Compressor_speed = 1;
	if (TRX.TX_Compressor_speed > 10)
		TRX.TX_Compressor_speed = 10;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain(int8_t direction)
{
	TRX.TX_Compressor_maxgain += direction;
	if (TRX.TX_Compressor_maxgain < 1)
		TRX.TX_Compressor_maxgain = 1;
	if (TRX.TX_Compressor_maxgain > 10)
		TRX.TX_Compressor_maxgain = 10;
}

static void SYSMENU_HANDL_AUDIO_FMSquelch(int8_t direction)
{
	if (direction < 0 && CurrentVFO()->FM_SQL_threshold == 0)
		return;
	CurrentVFO()->FM_SQL_threshold += direction;
	if (CurrentVFO()->FM_SQL_threshold > 10)
		CurrentVFO()->FM_SQL_threshold = 10;
	TRX.FM_SQL_threshold = CurrentVFO()->FM_SQL_threshold;

	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold = CurrentVFO()->FM_SQL_threshold;
}

