witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_BPF_2_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_2_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_2_START < 1)
		CALIBRATE.RFU_BPF_2_START = 1;
	if (CALIBRATE.RFU_BPF_2_START > 999999999)
		CALIBRATE.RFU_BPF_2_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_2_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_2_END < 1)
		CALIBRATE.RFU_BPF_2_END = 1;
	if (CALIBRATE.RFU_BPF_2_END > 999999999)
		CALIBRATE.RFU_BPF_2_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_3_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_3_START < 1)
		CALIBRATE.RFU_BPF_3_START = 1;
	if (CALIBRATE.RFU_BPF_3_START > 999999999)
		CALIBRATE.RFU_BPF_3_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_3_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_3_END < 1)
		CALIBRATE.RFU_BPF_3_END = 1;
	if (CALIBRATE.RFU_BPF_3_END > 999999999)
		CALIBRATE.RFU_BPF_3_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_4_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_4_START < 1)
		CALIBRATE.RFU_BPF_4_START = 1;
	if (CALIBRATE.RFU_BPF_4_START > 999999999)
		CALIBRATE.RFU_BPF_4_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_4_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_4_END < 1)
		CALIBRATE.RFU_BPF_4_END = 1;
	if (CALIBRATE.RFU_BPF_4_END > 999999999)
		CALIBRATE.RFU_BPF_4_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_5_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_5_START < 1)
		CALIBRATE.RFU_BPF_5_START = 1;
	if (CALIBRATE.RFU_BPF_5_START > 999999999)
		CALIBRATE.RFU_BPF_5_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_5_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_5_END < 1)
		CALIBRATE.RFU_BPF_5_END = 1;
	if (CALIBRATE.RFU_BPF_5_END > 999999999)
		CALIBRATE.RFU_BPF_5_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_6_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_6_START < 1)
		CALIBRATE.RFU_BPF_6_START = 1;
	if (CALIBRATE.RFU_BPF_6_START > 999999999)
		CALIBRATE.RFU_BPF_6_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_6_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_6_END < 1)
		CALIBRATE.RFU_BPF_6_END = 1;
	if (CALIBRATE.RFU_BPF_6_END > 999999999)
		CALIBRATE.RFU_BPF_6_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_7_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_7_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_7_START < 1)
		CALIBRATE.RFU_BPF_7_START = 1;
	if (CALIBRATE.RFU_BPF_7_START > 999999999)
		CALIBRATE.RFU_BPF_7_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_7_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_7_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_7_END < 1)
		CALIBRATE.RFU_BPF_7_END = 1;
	if (CALIBRATE.RFU_BPF_7_END > 999999999)
		CALIBRATE.RFU_BPF_7_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_8_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_8_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_8_START < 1)
		CALIBRATE.RFU_BPF_8_START = 1;
	if (CALIBRATE.RFU_BPF_8_START > 999999999)
		CALIBRATE.RFU_BPF_8_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_8_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_8_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_8_END < 1)
		CALIBRATE.RFU_BPF_8_END = 1;
	if (CALIBRATE.RFU_BPF_8_END > 999999999)
		CALIBRATE.RFU_BPF_8_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_9_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_9_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_9_START < 1)
		CALIBRATE.RFU_BPF_9_START = 1;
	if (CALIBRATE.RFU_BPF_9_START > 999999999)
		CALIBRATE.RFU_BPF_9_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_9_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_9_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_9_END < 1)
		CALIBRATE.RFU_BPF_9_END = 1;
	if (CALIBRATE.RFU_BPF_9_END > 999999999)
		CALIBRATE.RFU_BPF_9_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_HPF_START(int8_t direction)
{
	CALIBRATE.RFU_HPF_START += direction * 100000;
	if (CALIBRATE.RFU_HPF_START < 1)
		CALIBRATE.RFU_HPF_START = 1;
	if (CALIBRATE.RFU_HPF_START > 999999999)
		CALIBRATE.RFU_HPF_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration < 1.0f)
		CALIBRATE.SWR_FWD_Calibration = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration > 50.0f)
		CALIBRATE.SWR_FWD_Calibration = 50.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration < 1.0f)
		CALIBRATE.SWR_REF_Calibration = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration > 50.0f)
		CALIBRATE.SWR_REF_Calibration = 50.0f;
}

static void SYSMENU_HANDL_CALIB_VCXO(int8_t direction)
{
	CALIBRATE.VCXO_correction += direction;
	if (CALIBRATE.VCXO_correction < -100)
		CALIBRATE.VCXO_correction = -100;
	if (CALIBRATE.VCXO_correction > 100)
		CALIBRATE.VCXO_correction = 100;
}
//Tisho
static void SYSMENU_HANDL_CALIB_FW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.FW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.FW_AD8307_SLP < 20.0f)
		CALIBRATE.FW_AD8307_SLP = 20.0f;
	if (CALIBRATE.FW_AD8307_SLP > 30.0f)
		CALIBRATE.FW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_FW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.FW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.FW_AD8307_OFFS < 0.1f)
		CALIBRATE.FW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.FW_AD8307_OFFS > 4000.0f)
		CALIBRATE.FW_AD8307_OFFS = 4000.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.BW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.BW_AD8307_SLP < 20.0f)
		CALIBRATE.BW_AD8307_SLP = 20.0f;
	if (CALIBRATE.BW_AD8307_SLP > 30.0f)
		CALIBRATE.BW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.BW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.BW_AD8307_OFFS < 0.1f)
		CALIBRATE.BW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.BW_AD8307_OFFS > 4000.0f)
		CALIBRATE.BW_AD8307_OFFS = 4000.0f;
}
//end Tisho
static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_START(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_START += direction;
	if (CALIBRATE.FAN_MEDIUM_START < 10)
		CALIBRATE.FAN_MEDIUM_START = 10;
	if (CALIBRATE.FAN_MEDIUM_START > 100)
		CALIBRATE.FAN_MEDIUM_START = 100;
}

static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_STOP(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_STOP += direction;
	if (CALIBRATE.FAN_MEDIUM_STOP < 10)
		CALIBRATE.FAN_MEDIUM_STOP = 10;
	if (CALIBRATE.FAN_MEDIUM_STOP > (CALIBRATE.FAN_MEDIUM_START - 1))
		CALIBRATE.FAN_MEDIUM_STOP = CALIBRATE.FAN_MEDIUM_START - 1;
}

